In [1]:
import numpy as np
import pandas as pd

In [2]:
email="parth.mhatre76@gmail.com"

In [3]:
email.split("@")

['parth.mhatre76', 'gmail.com']

In [4]:
names=pd.Series(['andrew','peter','leon','david','5'])

In [5]:
names

0    andrew
1     peter
2      leon
3     david
4         5
dtype: object

In [6]:
names.str.upper()

0    ANDREW
1     PETER
2      LEON
3     DAVID
4         5
dtype: object

In [7]:
names.str.isdigit()

0    False
1    False
2    False
3    False
4     True
dtype: bool

In [8]:
names[names.str.isdigit()]

4    5
dtype: object

In [9]:
tech_finance=['GOOG,APPL,AMNZ','JPM,BAC,GS']

In [10]:
len(tech_finance)

2

In [11]:
tickers=pd.Series(tech_finance)

In [12]:
tickers

0    GOOG,APPL,AMNZ
1        JPM,BAC,GS
dtype: object

In [13]:
tickers.str.split(',')

0    [GOOG, APPL, AMNZ]
1        [JPM, BAC, GS]
dtype: object

In [14]:
tech="GOOG,APPL,AMNZ"
tech.split(',')[0]

'GOOG'

In [15]:
tickers.str.split(',')[0]

['GOOG', 'APPL', 'AMNZ']

In [16]:
tickers.str.split(',').str[0] # gives the first index

0    GOOG
1     JPM
dtype: object

In [17]:
tickers.str.split(',',expand=True) # split the string into a list of strings matlab automatically string ko single indivdual string me convert karta hai

      0     1     2
0  GOOG  APPL  AMNZ
1   JPM   BAC    GS

In [18]:
messy_names=pd.Series(['andrew  ','pe;ter','   leon   '])

In [19]:
messy_names

0      andrew
1        pe;ter
2       leon
dtype: object

In [20]:
messy_names.str.replace(';','').str.strip() # remove semicolons and whitespaces

0    andrew
1     peter
2      leon
dtype: object

In [21]:
messy_names.str.capitalize().str.replace(';','').str.strip()

0    Andrew
1     Peter
2      leon
dtype: object

In [22]:
def cleanup(name):
    name=name.replace(';','')
    name=name.strip()
    name=name.capitalize()
    return name

In [23]:
messy_names.apply(cleanup)

0    Andrew
1     Peter
2      Leon
dtype: object